<a href="https://colab.research.google.com/github/harsh277694/Python-Code/blob/main/Pandas_Introduction.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [126]:
#Import Python Libraries
import numpy as np
import pandas as pd
import matplotlib as mpl
import seaborn as sns

df =pd.read_csv("http://rcs.bu.edu/examples/python/data_analysis/Salaries.csv")

df.head()
df.shape
df.axes
df.ndim
df.values
df.size
df.describe
#Assignment
df.shape[0]
df.columns
df.dtypes

dir(df)
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [77]:
df.mean()

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [79]:
df.discipline

0     B
1     A
2     A
3     A
4     B
     ..
73    B
74    B
75    B
76    A
77    A
Name: discipline, Length: 78, dtype: object

In [78]:
df.discipline.value_counts()

B    42
A    36
Name: discipline, dtype: int64

In [80]:
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [81]:
df.std()

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [85]:
df.head(50).mean()

phd            21.52
service        17.60
salary     113789.14
dtype: float64

In [88]:
df.phd

0     56
1     12
2     23
3     40
4     20
      ..
73    18
74    19
75    17
76    28
77    23
Name: phd, Length: 78, dtype: int64

In [91]:
#Calculate basic statistics for the phd column
df.phd.describe()

count    78.000000
mean     19.705128
std      12.498425
min       1.000000
25%      10.250000
50%      18.500000
75%      27.750000
max      56.000000
Name: phd, dtype: float64

In [92]:
#Find how many values in the Phd Column(use count menthod)
df.phd.count()

78

In [93]:
#Calculate average of Phd
df.phd.mean()

19.705128205128204

In [101]:
#Grouping or slicing of data
#Calculate mean salary for each profesor rank
df.groupby('rank')[['salary','phd']].mean()

                  salary        phd
rank
AssocProf   91786.230769  15.076923
AsstProf    81362.789474   5.052632
Prof       123624.804348  27.065217

In [103]:
#Filter the data set for the salary>120000

df[df.salary>120000]

    rank discipline  phd  service     sex  salary
0   Prof          B   56       49    Male  186960
3   Prof          A   40       31    Male  131205
5   Prof          A   20       20    Male  122400
7   Prof          A   18       18    Male  126300
10  Prof          B   39       33    Male  128250
11  Prof          B   23       23    Male  134778
13  Prof          B   35       33    Male  162200
14  Prof          B   25       19    Male  153750
15  Prof          B   17        3    Male  150480
19  Prof          A   29       27    Male  150500
26  Prof          A   38       19    Male  148750
27  Prof          A   45       43    Male  155865
29  Prof          B   21       20    Male  123683
31  Prof          B   22       21    Male  155750
35  Prof          B   28       23    Male  126933
36  Prof          B   45       45    Male  146856
39  Prof          B   18       18  Female  129000
40  Prof          A   39       36  Female  137000
44  Prof          B   23       19  Female  151768
45  Prof          B   25       25  Female  140096
49  Prof          B   17       18  Female  122960
51  Prof          B   20       14  Female  127512
58  Prof          B   36       26  Female  144651
72  Prof          B   24       15  Female  161101
75  Prof          B   17       17  Female  124312

In [124]:
#Extract female whose service is more than 10 years

df[(df.sex=='Female') & (df.service>10)]

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49  Female  186960
2        Prof          A   23       20  Female  110515
3        Prof          A   40       31  Female  131205
4        Prof          B   20       18  Female  104800
5        Prof          A   20       20  Female  122400
6   AssocProf          A   20       17  Female   81285
7        Prof          A   18       18  Female  126300
8        Prof          A   29       19  Female   94350
9        Prof          A   51       51  Female   57800
10       Prof          B   39       33  Female  128250
11       Prof          B   23       23  Female  134778
13       Prof          B   35       33  Female  162200
14       Prof          B   25       19  Female  153750
19       Prof          A   29       27  Female  150500
21       Prof          A   33       30  Female  103106
24       Prof          A   30       23  Female   91100
25       Prof          B   35       31  Female   99418
26       Prof          A   38       19  Female  148750
27       Prof          A   45       43  Female  155865
29       Prof          B   21       20  Female  123683
31       Prof          B   22       21  Female  155750
32       Prof          A   27       19  Female  103275
33       Prof          B   18       18  Female  120000
35       Prof          B   28       23  Female  126933
36       Prof          B   45       45  Female  146856
39       Prof          B   18       18  Female  129000
40       Prof          A   39       36  Female  137000
44       Prof          B   23       19  Female  151768
45       Prof          B   25       25  Female  140096
47  AssocProf          B   11       11  Female  103613
48       Prof          B   17       17  Female  111512
49       Prof          B   17       18  Female  122960
51       Prof          B   20       14  Female  127512
54  AssocProf          A   25       22  Female   62884
58       Prof          B   36       26  Female  144651
63       Prof          A   29       27  Female   91000
64  AssocProf          A   26       24  Female   73300
65       Prof          A   36       19  Female  117555
67       Prof          A   17       11  Female   90450
72       Prof          B   24       15  Female  161101
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [128]:

df =pd.read_csv("http://rcs.bu.edu/examples/python/data_analysis/Salaries.csv")

In [129]:
#Data Frames iLoc Method used for slicing of data frames
df.iloc[0] #First row of the data frame

rank            Prof
discipline         B
phd               56
service           49
sex             Male
salary        186960
Name: 0, dtype: object

In [131]:
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [130]:
df.iloc[1:4,0:3]

   rank discipline  phd
1  Prof          A   12
2  Prof          A   23
3  Prof          A   40